Tekla.Structures.Geometry3d.VectorConversions
The Tekla.Structures.Geometry3d.VectorConversions class converts structures representing points and vectors
from Tekla.Structures.Geometry3d to Tekla.Common.Geometry.

Tekla.Structures.Geometry3d.VectorConversions.ToVector3(Tekla.Structures.Geometry3d.Point)
Converts a Tekla.Structures.Geometry3d.Point or a Tekla.Structures.Geometry3d.Vector to a Tekla.Common.Geometry.Vector3.
point: The Point to convert.
Returns: The resulting Tekla.Common.Geometry.Vector3.

Tekla.Structures.Geometry3d.VectorConversions.ToVector3(Tekla.Structures.Model.Offset)
Converts an Tekla.Structures.Model.Offset to a Tekla.Common.Geometry.Vector3.
offset: The Offset to convert.
Returns: The resulting Vector3.

Tekla.Structures.Geometry3d.VectorConversions.ToVector(Tekla.Structures.Model.Offset)
Converts an Tekla.Structures.Model.Offset to a Tekla.Structures.Geometry3d.Vector.
offset: The Offset to convert.
Returns: The resulting Vector.

Tekla.Structures.Geometry3d.VectorConversions.ToUnitVector3(Tekla.Structures.Geometry3d.Point)
Converts a Tekla.Structures.Geometry3d.Point or a Tekla.Structures.Geometry3d.Vector to a Tekla.Common.Geometry.UnitVector3.
point: The Point to convert.
Returns: The resulting Tekla.Common.Geometry.UnitVector3.

Tekla.Structures.Geometry3d.VectorConversions.TryToUnitVector3(Tekla.Structures.Geometry3d.Point,Tekla.Common.Geometry.UnitVector3@)
Converts a Tekla.Structures.Geometry3d.Point or a Tekla.Structures.Geometry3d.Vector to a Tekla.Common.Geometry.UnitVector3.
point: The Point to convert.
unitVector: The converted Tekla.Common.Geometry.UnitVector3 value.
Returns: True if the Tekla.Common.Geometry.UnitVector3 is valid; otherwise, false.

Tekla.Structures.Geometry3d.VectorConversions.ToVector3List(System.Collections.ArrayList)
Creates a list of Tekla.Common.Geometry.Vector3 from an array list of Tekla.Structures.Geometry3d.Point or Tekla.Structures.Geometry3d.Vector.
points: The list of points or vectors to convert.
Returns: The resulting list of Vector3s.

Tekla.Structures.Geometry3d.VectorConversions.ToVector3List(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point})
Creates a list of Tekla.Common.Geometry.Vector3 from an IEnumerable of Points.
points: The list of points to convert.
Returns: The resulting list of Vector3s.

Tekla.Structures.Geometry3d.VectorConversions.ToVector3List(Tekla.Structures.Solid.Loop)
Creates a list of Tekla.Common.Geometry.Vector3 from an Tekla.Structures.Solid.Loop.
loop: The loop to convert.
Returns: The resulting list of Vector3s.

Tekla.Structures.Geometry3d.VectorConversions.ToVector3List(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Geometry3d.Matrix)
Returns a list of Tekla.Common.Geometry.Vector3 after transforming the points using the matrix.
points: The points to transform.
matrix: The transformation matrix.
Returns: The list of transformed Tekla.Common.Geometry.Vector3.

Tekla.Structures.Geometry3d.VectorConversions.ToPoint(Tekla.Common.Geometry.Vector3)
Converts a Tekla.Common.Geometry.Vector3 to a Tekla.Structures.Geometry3d.Point.
vector: The Tekla.Common.Geometry.Vector3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.Point.

Tekla.Structures.Geometry3d.VectorConversions.ToPoint(Tekla.Common.Geometry.UnitVector3)
Converts a Tekla.Common.Geometry.UnitVector3 to a Tekla.Structures.Geometry3d.Point.
vector: The Tekla.Common.Geometry.UnitVector3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.Point.

Tekla.Structures.Geometry3d.VectorConversions.ToVector(Tekla.Common.Geometry.Vector3)
Converts a Tekla.Common.Geometry.Vector3 to a Tekla.Structures.Geometry3d.Vector.
vector: The Tekla.Common.Geometry.Vector3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.Vector.

Tekla.Structures.Geometry3d.VectorConversions.ToVector(Tekla.Common.Geometry.UnitVector3)
Converts a Tekla.Common.Geometry.UnitVector3 to a Tekla.Structures.Geometry3d.Vector.
vector: The Tekla.Common.Geometry.UnitVector3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.Vector.

Tekla.Structures.Geometry3d.VectorConversions.ToPointArrayList(System.Collections.ArrayList)
Creates an array list of Tekla.Structures.Geometry3d.Point from an array list of Tekla.Common.Geometry.Vector3.
vectors: The array list of Tekla.Common.Geometry.Vector3 to convert.
Returns: The resulting array list of Tekla.Structures.Geometry3d.Point.

Tekla.Structures.Geometry3d.VectorConversions.ToPointArrayList(System.Collections.Generic.IEnumerable{Tekla.Common.Geometry.Vector3})
Creates an array list of Tekla.Structures.Geometry3d.Point from a list of Tekla.Common.Geometry.Vector3.
vectors: The list of Tekla.Common.Geometry.Vector3 to convert.
Returns: The resulting array list of Tekla.Structures.Geometry3d.Point.

Tekla.Structures.Geometry3d.VectorConversions.ToPointList(System.Collections.ArrayList)
Creates a list of Tekla.Structures.Geometry3d.Point from an array list of Tekla.Common.Geometry.Vector3.
vectors: The array list of Tekla.Common.Geometry.Vector3 to convert.
Returns: The resulting list of Tekla.Structures.Geometry3d.Point.

Tekla.Structures.Geometry3d.VectorConversions.ToPointList(System.Collections.Generic.IEnumerable{Tekla.Common.Geometry.Vector3})
Creates a list of Tekla.Structures.Geometry3d.Point from a list of Tekla.Common.Geometry.Vector3.
vectors: The list of Tekla.Common.Geometry.Vector3 to convert.
Returns: The resulting list of Tekla.Structures.Geometry3d.Point.